// 기본과제
// 숫자 야구 게임
// 컴퓨터가 숫자 3개를 고른다.
// 사람이 숫자 3개를 입력한다.
// 숫자가 같고 위치가 같으면 스트라이크
// 숫자가 같고 위치가 다르면 볼
// 같은 숫자가 없으면 아웃
// 입력해서 몇번만에 3스트라이크, 즉 숫자를 맞추는지를 다룬 게임
// 123 -> 321 --> 1스트라이크, 2볼
// 123 -> 456 --> 3아웃
// 이것에 대한 구상도를 그림으로 그려와라
// 최대한 자세하게 --> 구상도를 코드화했을 때 바로 만들 수 있게끔(예시 노트에 적어둠)
// https://app.diagrams.net/

// <전공자 전용 숙제>
// 피보나치 1, 1, 2, 3, 5, 8, 13, 21, ..... 세번째 숫자부터 앞자리 2개 더하기
// 하노이의 탑
// 조건 : 봉이 3개, 첫번째 봉에서 3번째 봉까지 이동을 시킨다.
// 블럭은 한번에 하나만 옮길 수 있다.
// 순서는 기존에 쌓여있는 순서와 같게  쌓아야한다.
// 작은 블럭은 큰 블럭 아래에 넣을 수 있다.
// 나는 피보나치 수를 고민을 해와야한다.

// 일요일 저녁 9시까지
